// ======================================
// Pokémon GO CP 계산기
// pokemon.js
// 포켓몬 데이터 저장
// ======================================

// 모든 포켓몬 데이터를 저장하는 객체
const pokemonData = {

    // ==========================
    // 불켜미
    // ==========================
    litwick:{

        // 화면에 표시될 이름
        name:"불켜미",

        // 최종 진화 이름
        finalName:"샹델라",

        // 최종 진화 종족값
        attack:271,
        defense:182,
        stamina:155,

        // 진화 단계
        evolution:2

    },

    // ==========================
    // 꾸꾸리
    // ==========================

    swinub:{

        name:"꾸꾸리",

        finalName:"맘모꾸리",

        attack:247,

        defense:146,

        stamina:242,

        evolution:2

    },

    // ==========================
    // 식스테일
    // ==========================

    vulpix:{

        name:"식스테일",

        finalName:"나인테일",

        attack:169,

        defense:190,

        stamina:177,

        evolution:1

    }

};
